OpenDTEF-v2012/tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/precursor/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

#------------------------------------------------------------------------------